In [1]:
import sqlite3
banco = sqlite3.connect('exercicio.db')
cursor = banco.cursor()

In [41]:
cursor.execute("CREATE TABLE funcionarios (idFuncionario integer,primeiroNome text,segundoNome text,ultimoNome text,dataNasc integer,CPF text,RG text,Endereco text,CEP text,Cidade text,Fone text,CodDepartamento integer,Funcao text,Salario integer)")
cursor.execute("CREATE TABLE departamento (Codigo integer, Nome text, Localizacao text, CodigoFuncionarioGerente integer)")

OperationalError: table funcionarios already exists

In [12]:
listaFuncionarios = [('1','Felipe','Oliveira','Souza','15/8/1997','06467681070','436842907','Rua das Seringueiras','78556110','Sinop','25421245','1','Programador','1000'),
                    ('2','Marcos','Santos','Alves','15/2/1994','06445642070','836352907','Rua Seringueiras','78556110','Sinop','25421245','2','Analista','1200'),
                    ('3','Fernanda','Dias','Anjos','18/12/1995','06749681070','534142907','Rua gueiras','78556110','Sinop','25421245','3','Analista','900'),
                    ('4','Pietra','Costa','Anjos','05/6/2002','06749681070','634542907','Rua das Seriras','78556110','Sinop','25421245','3','Segurança','920'),
                    ('5','Fabrício','Souza','Alves','25/9/1985','0641941070','123562907','Rua das ringueiras','78556110','Sinop','25421245','4','Programador','850'),
                    ('6','Livia','Lima','Anjos','23/3/2000','06460231070','542352907','Rua dasiras','78556110','Sinop','25421245','5','Engenheiro','870'),
                    ('7','Vitória','Pereira','Souza','20/5/2004','53127681070','234142907','Rua singueiras','78556110','Sinop','25421245','5','Advogado','790'),
                    ('8','Arthur','Rodrigues','Anjos','20/7/1989','53234681070','734842907','Rua das Seringueiras','78556110','Sinop','25421245','2','Cientista','1100'),
                    ('9','Guilherme','Alves','Anjos','25/5/1994','45621681070','156842907','Rua ingueiras','78556110','Sinop','25421245','1','Matemático','950'),
                    ('10','Leticia','Nascimento','Anjos','13/4/1994','97437681070','734842907','Rua das Serras','78556110','Sinop','25421245','1','Gerente','1300')]

In [27]:
listaDepartamentos = [('1', 'A', 'Norte', '5'),
                     ('2', 'B', 'Sul', '1'),
                     ('3', 'C', 'Leste', '2'),
                     ('4', 'D', 'Oeste', '3'),
                     ('5', 'E', 'Noroeste', '4')]

In [31]:
cursor.executemany("""INSERT INTO funcionarios VALUES(?,?,?,?,?,?,?,?,?,?,?,?,?,?)""", listaFuncionarios)
cursor.executemany("""INSERT INTO departamento VALUES(?,?,?,?)""", listaDepartamentos)
banco.commit()

In [33]:
cursor.execute("SELECT primeiroNome, segundoNome FROM funcionarios GROUP BY segundoNome")
print(cursor.fetchall())

[('Guilherme', 'Alves'), ('Pietra', 'Costa'), ('Fernanda', 'Dias'), ('Livia', 'Lima'), ('Leticia', 'Nascimento'), ('Felipe', 'Oliveira'), ('Vitória', 'Pereira'), ('Arthur', 'Rodrigues'), ('Marcos', 'Santos'), ('Fabrício', 'Souza')]

In [35]:
cursor.execute("SELECT primeiroNome, segundoNome, ultimoNome,dataNasc, CPF, RG,Endereco, CEP,Cidade, Fone,CodDepartamento, Funcao, Salario FROM funcionarios ORDER BY Cidade")
print(cursor.fetchall())

[('Felipe', 'Oliveira', 'Souza', '15/8/1997', '06467681070', '436842907', 'Rua das Seringueiras', '78556110', 'Sinop', '25421245', 1, 'Programador', 1000), ('Marcos', 'Santos', 'Alves', '15/2/1994', '06445642070', '836352907', 'Rua Seringueiras', '78556110', 'Sinop', '25421245', 2, 'Analista', 1200), ('Fernanda', 'Dias', 'Anjos', '18/12/1995', '06749681070', '534142907', 'Rua gueiras', '78556110', 'Sinop', '25421245', 3, 'Analista', 900), ('Pietra', 'Costa', 'Anjos', '05/6/2002', '06749681070', '634542907', 'Rua das Seriras', '78556110', 'Sinop', '25421245', 3, 'Segurança', 920), ('Fabrício', 'Souza', 'Alves', '25/9/1985', '0641941070', '123562907', 'Rua das ringueiras', '78556110', 'Sinop', '25421245', 4, 'Programador', 850), ('Livia', 'Lima', 'Anjos', '23/3/2000', '06460231070', '542352907', 'Rua dasiras', '78556110', 'Sinop', '25421245', 5, 'Engenheiro', 870), ('Vitória', 'Pereira', 'Souza', '20/5/2004', '53127681070', '234142907', 'Rua singueiras', '78556110', 'Sinop', '25421245', 5, 'Advogado', 790), ('Arthur', 'Rodrigues', 'Anjos', '20/7/1989', '53234681070', '734842907', 'Rua das Seringueiras', '78556110', 'Sinop', '25421245', 2, 'Cientista', 1100), ('Guilherme', 'Alves', 'Anjos', '25/5/1994', '45621681070', '156842907', 'Rua ingueiras', '78556110', 'Sinop', '25421245', 1, 'Matemático', 950), ('Leticia', 'Nascimento', 'Anjos', '13/4/1994', '97437681070', '734842907', 'Rua das Serras', '78556110', 'Sinop', '25421245', 1, 'Gerente', 1300)]

In [37]:
cursor.execute("SELECT primeiroNome FROM funcionarios WHERE salario > '1000'")
print(cursor.fetchall())

[('Marcos',), ('Arthur',), ('Leticia',)]

In [42]:
cursor.execute("SELECT primeiroNome, dataNasc FROM funcionarios GROUP BY dataNasc")
print(cursor.fetchall())

[('Pietra', '05/6/2002'), ('Leticia', '13/4/1994'), ('Marcos', '15/2/1994'), ('Felipe', '15/8/1997'), ('Fernanda', '18/12/1995'), ('Vitória', '20/5/2004'), ('Arthur', '20/7/1989'), ('Livia', '23/3/2000'), ('Guilherme', '25/5/1994'), ('Fabrício', '25/9/1985')]

In [43]:
cursor.execute("SELECT SUM(salario) FROM funcionarios")
print(cursor.fetchall())

[(9880,)]

In [66]:
sql = """SELECT
    funcionarios.primeiroNome,
    funcionarios.funcao,
    departamento.nome
FROM funcionarios
LEFT JOIN departamento ON funcionarios.CodDepartamento = departamento.Codigo"""

cursor.execute(sql)
cursor.fetchall()

[('Felipe', 'Programador', 'A'),
 ('Marcos', 'Analista', 'B'),
 ('Fernanda', 'Analista', 'C'),
 ('Pietra', 'Segurança', 'C'),
 ('Fabrício', 'Programador', 'D'),
 ('Livia', 'Engenheiro', 'E'),
 ('Vitória', 'Advogado', 'E'),
 ('Arthur', 'Cientista', 'B'),
 ('Guilherme', 'Matemático', 'A'),
 ('Leticia', 'Gerente', 'A')]

In [70]:
len(listaFuncionarios)

10

In [74]:
sql = """SELECT
    funcionarios.primeiroNome,
    departamento.nome
FROM funcionarios
LEFT JOIN departamento ON funcionarios.CodDepartamento = departamento.Codigo GROUP BY funcionarios.primeiroNome"""

cursor.execute(sql)
cursor.fetchall()

[('Arthur', 'B'),
 ('Fabrício', 'D'),
 ('Felipe', 'A'),
 ('Fernanda', 'C'),
 ('Guilherme', 'A'),
 ('Leticia', 'A'),
 ('Livia', 'E'),
 ('Marcos', 'B'),
 ('Pietra', 'C'),
 ('Vitória', 'E')]

In [81]:
sql = """SELECT
    funcionarios.primeiroNome,
    departamento.nome
FROM funcionarios
CROSS JOIN departamento ON funcionarios.CodDepartamento = departamento.Codigo GROUP BY departamento.nome"""

cursor.execute(sql)
cursor.fetchall()

[('Felipe', 'A'),
 ('Marcos', 'B'),
 ('Fernanda', 'C'),
 ('Fabrício', 'D'),
 ('Livia', 'E')]